# Exercise notebook 2: Cleaning up our act
This Jupyter notebook, for the second part of The Open University's _Learn to code for Data Analysis_ course, has code examples and coding activities for you. Remember to run the code in this notebook before you start.

You'll come across steps in the course directing you to this notebook. Once you've done each exercise, go back to the corresponding step and mark it as complete.

In [59]:
import warnings
warnings.simplefilter('ignore', FutureWarning)

from pandas import *

## Exercise 1: Dataframes and CSV files

To read a CSV file into a dataframe you need to call the pandas function called <code>read_csv()</code>. The simplest usage of this function is with a single argument, a string that holds the name of the CSV file, for example.

In [60]:
df = read_csv('WHO POP TB all.csv')

### Dataframe attributes

A dataframe attribute is like a variable that can only be accessed in the context of a dataframe. One such attribute is <code>columns</code> which holds a dataframe's column names.

In [61]:
df.columns

Index(['Country', 'Population (1000s)', 'TB deaths'], dtype='object')

### Dataframe rows
A dataframe has a default integer index for its rows, which starts at zero. The `iloc` attribute can be used to obtain the row at the given index.

In [62]:
df.iloc[0] # first row, index 0

Country               Afghanistan
Population (1000s)          30552
TB deaths                 13000.0
Name: 0, dtype: object

In [63]:
df.iloc[2] # third row, index 2

Country               Algeria
Population (1000s)      39208
TB deaths              5100.0
Name: 2, dtype: object

### The <code>head()</code> method

The `head()` method returns a dataframe with the first rows, as many as given in the argument. By default, if the argument is missing, it returns the first five rows.

In [64]:
df.head() # first five rows

       Country  Population (1000s)  TB deaths
0  Afghanistan               30552   13000.00
1      Albania                3173      20.00
2      Algeria               39208    5100.00
3      Andorra                  79       0.26
4       Angola               21472    6900.00

In [65]:
df.head(7) # first seven rows

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00

### The <code>tail()</code> method
The <code>tail()</code> method is similar to the <code>head()</code> method. If no argument is used, the last five rows of the dataframe are returned, otherwise the number of rows returned is dependent on the argument.

In [66]:
df.tail() # last five rows

                                Country  Population (1000s)  TB deaths
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

### Selecting and displaying columns in a dataframe
You found in Week 1 that you can select and display the values for a single dataframe column by puting the name of the column (in quotes) within square brackets immediately after the dataframe's name. However you can also select and display the values for multiple columns too.

To get multiple columns you need to use a list. A list in Python is a number of items separated by commas within square brackets, for example `['Country', 'Population (1000s)']`. This list is then put within square brackets immediately after the dataframe's name. The resulting expression represents a new dataframe, just with those columns, and therefore any dataframe method can be applied to it, like for example `head()`:

In [67]:
df[['Country', 'Population (1000s)']].head()

       Country  Population (1000s)
0  Afghanistan               30552
1      Albania                3173
2      Algeria               39208
3      Andorra                  79
4       Angola               21472

### Applying methods to a dataframe column
The `iloc` attribute and the <code>head()</code> and <code>tail()</code> methods discussed above can be used with single columns.

In [68]:
df['TB deaths'].iloc[2] # third value of deaths column

np.float64(5100.0)

In [69]:
df['Population (1000s)'].tail() # last five values of population column

189    30405
190    91680
191    24407
192    14539
193    14150
Name: Population (1000s), dtype: int64

### Tasks

In the code cell below, write the code to get and display the 55th row in the dataframe <code>df</code>.

In [70]:
df.iloc[55]

Country               Equatorial Guinea
Population (1000s)                  757
TB deaths                          67.0
Name: 55, dtype: object

In the code cell below write the code to display the first 10 rows of the dataframe <code>df</code>.

In [71]:
df.head(10)

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00
7              Armenia                2977     170.00
8            Australia               23343      45.00
9              Austria                8495      29.00

In the code cell below, select and display the first eight rows from the <code>'Country'</code> and <code>'TB deaths'</code> columns.

In [72]:
df[["Country", "TB deaths"]].head(8)

               Country  TB deaths
0          Afghanistan   13000.00
1              Albania      20.00
2              Algeria    5100.00
3              Andorra       0.26
4               Angola    6900.00
5  Antigua and Barbuda       1.20
6            Argentina     570.00
7              Armenia     170.00

**Now go back to the course.**

## Exercise 2: Comparison operators
Python has the following comparison operators:

    == (equals)
    != (not equal)
    < (less than)
    > (greater than)
    <= (less than or equal to)
    >= (greater than or equal to)

The following code will get and display all the rows in `df` where it is `True` that the value in the `'Population (1000s)'` column is greater than `80000`.

In [73]:
df[df['Population (1000s)'] > 80000]

                      Country  Population (1000s)  TB deaths
13                 Bangladesh              156595    80000.0
23                     Brazil              200362     4400.0
36                      China             1393337    41000.0
53                      Egypt               82056      550.0
58                   Ethiopia               94101    30000.0
65                    Germany               82727      300.0
77                      India             1252140   240000.0
78                  Indonesia              249866    64000.0
85                      Japan              127144     2100.0
109                    Mexico              122332     2200.0
124                   Nigeria              173615   160000.0
128                  Pakistan              182143    49000.0
134               Philippines               98394    27000.0
141        Russian Federation              142834    17000.0
185  United States of America              320051      490.0
190                  Viet Nam               91680    17000.0

### Task
In the code cell below write code to find all the rows in <code>df</code> where TB deaths exceed 10000.

In [74]:
df[df["TB deaths"] > 10000]

                              Country  Population (1000s)  TB deaths
0                         Afghanistan               30552    13000.0
13                         Bangladesh              156595    80000.0
36                              China             1393337    41000.0
47   Democratic Republic of the Congo               67514    46000.0
58                           Ethiopia               94101    30000.0
77                              India             1252140   240000.0
78                          Indonesia              249866    64000.0
100                        Madagascar               22925    12000.0
115                        Mozambique               25834    18000.0
116                           Myanmar               53259    26000.0
124                           Nigeria              173615   160000.0
128                          Pakistan              182143    49000.0
134                       Philippines               98394    27000.0
141                Russian Federation              142834    17000.0
159                      South Africa               52776    25000.0
190                          Viet Nam               91680    17000.0

**Now go back to the course.**

## Exercise 3: Bitwise operators

Pandas has two operators to make more complicated queries. Use the operator `&` (means 'and') to select rows where two conditions are both true. Use the operator `|` (means 'or') to select rows where at least one condition is true. Don't forget to put parentheses around _each_ comparison. For example, the following expression selects only countries with a population over 80 million inhabitants **and** with more that 10 thousand deaths.

In [75]:
df[(df['Population (1000s)'] > 80000) & (df['TB deaths'] > 10000)]

                Country  Population (1000s)  TB deaths
13           Bangladesh              156595    80000.0
36                China             1393337    41000.0
58             Ethiopia               94101    30000.0
77                India             1252140   240000.0
78            Indonesia              249866    64000.0
124             Nigeria              173615   160000.0
128            Pakistan              182143    49000.0
134         Philippines               98394    27000.0
141  Russian Federation              142834    17000.0
190            Viet Nam               91680    17000.0

If the same columns will be used repeatedly in the program, the code becomes more readable if written as follows:

In [76]:
population = df['Population (1000s)']
deaths = df['TB deaths']
df[(population > 80000) & (deaths > 10000)]

                Country  Population (1000s)  TB deaths
13           Bangladesh              156595    80000.0
36                China             1393337    41000.0
58             Ethiopia               94101    30000.0
77                India             1252140   240000.0
78            Indonesia              249866    64000.0
124             Nigeria              173615   160000.0
128            Pakistan              182143    49000.0
134         Philippines               98394    27000.0
141  Russian Federation              142834    17000.0
190            Viet Nam               91680    17000.0

### Task
In the code cell below find  all the countries where the Population (1000s) is **less than or equal to** 50000 **or** TB deaths are **greater than or equal to** 20000.

In [77]:
population = df['Population (1000s)']
deaths = df['TB deaths']
df[(population <= 50000) | (deaths >= 20000)]

                                Country  Population (1000s)  TB deaths
0                           Afghanistan               30552   13000.00
1                               Albania                3173      20.00
2                               Algeria               39208    5100.00
3                               Andorra                  79       0.26
4                                Angola               21472    6900.00
..                                  ...                 ...        ...
188                             Vanuatu                 253      16.00
189  Venezuela (Bolivarian Republic of)               30405     480.00
191                               Yemen               24407     990.00
192                              Zambia               14539    3600.00
193                            Zimbabwe               14150    5700.00

[180 rows x 3 columns]

In [78]:
df[(df['Country'].str.startswith('C')) & (df['Population (1000s)'] < 1000)]

         Country  Population (1000s)  TB deaths
29    Cabo Verde                 499     150.00
38       Comoros                 735      58.00
40  Cook Islands                  21       0.41

**Now go back to the course.**

## Exercise 4: Display rows from dataframe

You have downloaded the file London_2014.csv from our website, it can now be read into a dataframe.

In [79]:
london = read_csv('London_2014.csv')
london.head()

,GMT,Max TemperatureC,Mean TemperatureC,Min TemperatureC,Dew PointC,MeanDew PointC,Min DewpointC,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityKm,Mean VisibilityKm,Min VisibilitykM,Max Wind SpeedKm/h,Mean Wind SpeedKm/h,Max Gust SpeedKm/h,Precipitationmm,CloudCover,Events,WindDirDegrees<br />
0,2014-1-1,11,8,6,9,7,4,94,86,73,...,31,11,2,40,26,66.0,9.91,4.0,Rain,186<br />
1,2014-1-2,11,9,6,9,6,4,94,81,60,...,31,15,5,32,21,50.0,1.02,2.0,Rain,214<br />
2,2014-1-3,11,8,6,9,5,2,94,76,54,...,31,12,0,50,29,69.0,7.11,2.0,Rain-Thunderstorm,219<br />
3,2014-1-4,9,6,3,8,6,2,93,85,65,...,31,12,5,35,21,39.0,9.91,4.0,Rain,211<br />
4,2014-1-5,12,7,1,11,4,-1,100,88,77,...,31,14,5,35,16,NaN,0.25,5.0,Rain,199<br />

### Removing initial spaces

There are too many columns for the dataframe to fit horizontally in this notebook, but they can be displayed separately.

In [80]:
london.columns

Index(['GMT', 'Max TemperatureC', 'Mean TemperatureC', 'Min TemperatureC',
       'Dew PointC', 'MeanDew PointC', 'Min DewpointC', 'Max Humidity',
       ' Mean Humidity', ' Min Humidity', ' Max Sea Level PressurehPa',
       ' Mean Sea Level PressurehPa', ' Min Sea Level PressurehPa',
       ' Max VisibilityKm', ' Mean VisibilityKm', ' Min VisibilitykM',
       ' Max Wind SpeedKm/h', ' Mean Wind SpeedKm/h', ' Max Gust SpeedKm/h',
       'Precipitationmm', ' CloudCover', ' Events', 'WindDirDegrees<br />'],
      dtype='object')

This shows that <code>' Max Wind SpeedKm/h'</code> is prefixed by a space, as are other columm names such as <code>' Mean Humidity'</code> and <code>' Max Sea Level PressurehPa'</code>.

The  <code>read_csv()</code> function has interpreted spaces after commas as being part of the next value. This can be rectified  easily by adding another argument to the <code>read_csv()</code> function to skip the initial spaces after a comma.

In [101]:
london = read_csv('London_2014.csv', skipinitialspace=True)

### Removing extra characters

Another problem shown above is that the final column is called <code>'WindDirDegrees&lt; br /&gt;'</code>.

When the dataset was exported from the Weather Underground web site, HTML line breaks were automatically added to each line in the file which <code>read_csv()</code> has interpreted as part of the column name and its values. This can be seen more clearly by looking at more values in the final column:

In [102]:
london['WindDirDegrees<br />'].head()

0    186<br />
1    214<br />
2    219<br />
3    211<br />
4    199<br />
Name: WindDirDegrees<br />, dtype: object

<code>'WindDirDegrees&lt; br /&gt;'</code> can be changed to <code>'WindDirDegrees'</code> with the <code>rename()</code> method as follows:

In [103]:
london = london.rename(columns={'WindDirDegrees<br />' : 'WindDirDegrees'})

To remove the <code>'&lt; br /&gt;'</code> html line breaks from the values in the <code>'WindDirDegrees'</code> column you need to use the string method <code>rstrip()</code> which is used to remove characters from the *end* or 'rear' of a string:

In [104]:
london['WindDirDegrees'] = london['WindDirDegrees'].str.rstrip('<br />')

Display the first few rows of the <code>'WindDirDegrees'</code> to confirm the change:

In [105]:
london['WindDirDegrees'].head()

0    186
1    214
2    219
3    211
4    199
Name: WindDirDegrees, dtype: object

### Missing values

Missing (also called null or not available) values are marked as NaN (not a number) in dataframes.

In [106]:
london['Events'].tail()

360    Rain
361     NaN
362     NaN
363     NaN
364     Fog
Name: Events, dtype: object

The `isnull()` method returns `True` for each row in a column that has a null value. The method can be used to select and display those rows. Scroll the table below to the right to check that the events column is only showing missing values.

In [107]:
london[london['Events'].isnull()]

,GMT,Max TemperatureC,Mean TemperatureC,Min TemperatureC,Dew PointC,MeanDew PointC,Min DewpointC,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityKm,Mean VisibilityKm,Min VisibilitykM,Max Wind SpeedKm/h,Mean Wind SpeedKm/h,Max Gust SpeedKm/h,Precipitationmm,CloudCover,Events,WindDirDegrees
32,2014-2-2,10,8,5,4,3,1,93,71,43,...,31,16,10,37,24,47.0,0.00,2.0,NaN,216
33,2014-2-3,8,6,3,5,3,2,93,79,55,...,31,15,10,32,18,NaN,0.00,4.0,NaN,133
43,2014-2-13,8,6,3,2,1,-1,81,66,45,...,31,15,10,42,27,48.0,0.00,2.0,NaN,236
52,2014-2-22,12,8,4,5,3,1,87,68,38,...,31,16,10,29,21,NaN,0.00,2.0,NaN,228
63,2014-3-5,13,7,0,4,2,-1,100,72,40,...,31,15,8,21,6,NaN,0.25,1.0,NaN,248
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
351,2014-12-18,13,12,11,11,11,10,94,85,74,...,31,12,10,37,29,60.0,0.00,6.0,NaN,245
358,2014-12-25,8,6,2,3,2,1,93,79,51,...,31,19,10,24,16,NaN,0.00,1.0,NaN,275
361,2014-12-28,6,2,-2,1,-2,-3,100,76,45,...,31,17,8,16,11,NaN,0.00,1.0,NaN,5
362,2014-12-29,6,1,-4,2,-1,-4,100,87,62,...,24,10,5,13,8,NaN,0.25,1.0,NaN,289
363,2014-12-30,6,1,-4,2,-1,-4,100,90,68,...,27,9,3,14,6,NaN,0.25,3.0,NaN,258

One way to deal with missing values is to replace them by some value. The column method `fillna()` fills all not available value cells with the value given as argument. In the example below, each missing event is replaced by the empty string.

In [108]:
london['Events'] = london['Events'].fillna('')
london[london['Events'].isnull()]

Empty DataFrame
Columns: [GMT, Max TemperatureC, Mean TemperatureC, Min TemperatureC, Dew PointC, MeanDew PointC, Min DewpointC, Max Humidity, Mean Humidity, Min Humidity, Max Sea Level PressurehPa, Mean Sea Level PressurehPa, Min Sea Level PressurehPa, Max VisibilityKm, Mean VisibilityKm, Min VisibilitykM, Max Wind SpeedKm/h, Mean Wind SpeedKm/h, Max Gust SpeedKm/h, Precipitationmm, CloudCover, Events, WindDirDegrees]
Index: []

[0 rows x 23 columns]

The empty dataframe (no rows) confirms there are no more missing event values.

Another way to deal with missing values is to ignore rows with them. The `dropna()` dataframe method returns a new dataframe where all rows with at least one non-available value have been removed.

In [109]:
london.dropna()

,GMT,Max TemperatureC,Mean TemperatureC,Min TemperatureC,Dew PointC,MeanDew PointC,Min DewpointC,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityKm,Mean VisibilityKm,Min VisibilitykM,Max Wind SpeedKm/h,Mean Wind SpeedKm/h,Max Gust SpeedKm/h,Precipitationmm,CloudCover,Events,WindDirDegrees
0,2014-1-1,11,8,6,9,7,4,94,86,73,...,31,11,2,40,26,66.0,9.91,4.0,Rain,186
1,2014-1-2,11,9,6,9,6,4,94,81,60,...,31,15,5,32,21,50.0,1.02,2.0,Rain,214
2,2014-1-3,11,8,6,9,5,2,94,76,54,...,31,12,0,50,29,69.0,7.11,2.0,Rain-Thunderstorm,219
3,2014-1-4,9,6,3,8,6,2,93,85,65,...,31,12,5,35,21,39.0,9.91,4.0,Rain,211
5,2014-1-6,12,10,8,11,8,6,94,78,60,...,31,12,5,50,29,61.0,2.03,4.0,Rain,219
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,2014-12-22,13,12,10,11,9,7,94,77,63,...,31,14,8,40,32,55.0,0.00,5.0,Rain,240
356,2014-12-23,13,11,10,9,7,5,82,72,58,...,31,12,10,42,32,61.0,0.00,4.0,Rain,238
357,2014-12-24,12,8,4,10,4,-2,94,71,38,...,31,13,10,34,26,45.0,0.25,5.0,Rain,262
360,2014-12-27,4,3,2,8,1,-1,93,83,64,...,31,13,9,42,26,61.0,0.00,4.0,Rain,330
364,2014-12-31,8,2,-4,5,2,-4,100,89,70,...,19,9,0,23,8,37.0,0.25,4.0,Fog,201

Note that the table above has fewer than 251 of the original 365 rows, so there must be further null values besides the 114 missing events.

### Changing the value type of a column

The type of every column in a dataframe can be determined by looking at the dataframe's `dtypes` attribute, like this:

In [110]:
london.dtypes

GMT                            object
Max TemperatureC                int64
Mean TemperatureC               int64
Min TemperatureC                int64
Dew PointC                      int64
MeanDew PointC                  int64
Min DewpointC                   int64
Max Humidity                    int64
Mean Humidity                   int64
Min Humidity                    int64
Max Sea Level PressurehPa       int64
Mean Sea Level PressurehPa      int64
Min Sea Level PressurehPa       int64
Max VisibilityKm                int64
Mean VisibilityKm               int64
Min VisibilitykM                int64
Max Wind SpeedKm/h              int64
Mean Wind SpeedKm/h             int64
Max Gust SpeedKm/h            float64
Precipitationmm               float64
CloudCover                    float64
Events                         object
WindDirDegrees                 object
dtype: object

The type of all the values in a column can be changed using the <code>astype()</code> method. The following code will change the values in the <code>'WindDirDegrees'</code> column from strings (`object`) to integers (<code>int64</code>).

In [111]:
london['WindDirDegrees'] = london['WindDirDegrees'].astype('int64')

The function `to_datetime()` is needed to change the values in the `'GMT'` column from strings (`object`) to dates (`datetime64`):

In [112]:
london['GMT'] = to_datetime(london['GMT'])
london.dtypes

GMT                           datetime64[ns]
Max TemperatureC                       int64
Mean TemperatureC                      int64
Min TemperatureC                       int64
Dew PointC                             int64
MeanDew PointC                         int64
Min DewpointC                          int64
Max Humidity                           int64
Mean Humidity                          int64
Min Humidity                           int64
Max Sea Level PressurehPa              int64
Mean Sea Level PressurehPa             int64
Min Sea Level PressurehPa              int64
Max VisibilityKm                       int64
Mean VisibilityKm                      int64
Min VisibilitykM                       int64
Max Wind SpeedKm/h                     int64
Mean Wind SpeedKm/h                    int64
Max Gust SpeedKm/h                   float64
Precipitationmm                      float64
CloudCover                           float64
Events                                object
WindDirDegrees                         int64
dtype: object

Values of type `datetime64` can be created using the `datetime()` function, provided by the package of the same name. The first integer argument is the year, the second the month and the third the day. 
The code below will get and display the row in the dataframe whose `'GMT'` value is 4th June 2014.

In [113]:
from datetime import datetime

london[london['GMT'] == datetime(2014, 6, 4)]

,GMT,Max TemperatureC,Mean TemperatureC,Min TemperatureC,Dew PointC,MeanDew PointC,Min DewpointC,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityKm,Mean VisibilityKm,Min VisibilitykM,Max Wind SpeedKm/h,Mean Wind SpeedKm/h,Max Gust SpeedKm/h,Precipitationmm,CloudCover,Events,WindDirDegrees
154,2014-06-04,14,11,8,11,9,3,94,78,47,...,31,12,7,47,13,64.0,2.03,4.0,Rain-Thunderstorm,230

Queries such as 'Return all the rows where the date is between 8 December and 12 December' can be made:

In [114]:
dates = london['GMT']
start = datetime(2014, 12, 8)
end = datetime(2014, 12, 12)
london[(dates >= start) & (dates <= end)]

,GMT,Max TemperatureC,Mean TemperatureC,Min TemperatureC,Dew PointC,MeanDew PointC,Min DewpointC,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityKm,Mean VisibilityKm,Min VisibilitykM,Max Wind SpeedKm/h,Mean Wind SpeedKm/h,Max Gust SpeedKm/h,Precipitationmm,CloudCover,Events,WindDirDegrees
341,2014-12-08,7,4,1,2,1,-1,93,76,51,...,31,17,10,23,13,NaN,0.00,2.0,Rain,270
342,2014-12-09,12,6,-1,11,3,-1,100,86,64,...,31,15,3,37,14,52.0,0.25,5.0,Rain,224
343,2014-12-10,9,7,6,11,3,1,90,70,44,...,31,18,3,40,27,NaN,0.00,2.0,Rain,246
344,2014-12-11,10,8,5,6,3,2,82,72,51,...,31,15,10,40,31,NaN,0.25,2.0,Rain,246
345,2014-12-12,9,6,2,9,4,-1,94,79,59,...,31,11,3,40,26,55.0,1.02,3.0,Rain,253

### Tasks

Now that the wind direction is given by a number, write code to select all days that had a northerly wind. Hint: select the rows where the direction is greater than or equal to 350 **or** smaller than or equal to 10, as the compass rose shows.

In [115]:
df[(df['WindDirDegrees'] >= 350) | (df['WindDirDegrees'] <= 10)]

KeyError: 'WindDirDegrees'

In the code cell below, write code to get and display all the rows in the dataframe that are beween 1 April 2014 and 
11 April 2014.

In [116]:
df[(df['GMT'] >= '2014-04-01') & (df['GMT'] <= '2014-04-11')]

KeyError: 'GMT'

In the cell below, write two lines of code to display the first five rows that have a missing value in the `'Max Gust SpeedKm/h'` column. Hint: first select the missing value rows and store them in a new dataframe, then display the first five rows of the new dataframe.

**Now go back to the course.**

## Exercise 5: Every picture tells a story

The following line of code tells Jupyter to display inside this notebook any graph that is created.

In [117]:
%matplotlib inline

The `plot()` method can make a graph of the values in a column. Gridlines are turned on by the `grid` argument.

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True)

The graph can be made bigger by giving the method a `figsize=(x,y)` argument where `x` and `y` are integers that determine the length of the x-axis and y-axis.

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True, figsize=(10,5))

Multiple lines can be plotted by selecting multiple columns.

In [ ]:
london[['Max Wind SpeedKm/h', 'Mean Wind SpeedKm/h']].plot(grid=True, figsize=(10,5))

### Task

In the cell below, write code to plot the minimum, mean, and maximum temperature during 2014 in London.

**Now go back to the course.**

## Exercise 6: Changing a dataframe's index
Changing the dataframe's index from the default to `datetime64` values is done by assigning to the dataframe's `index` attribute the contents of the `'GMT`' column, like this:

In [ ]:
london.index = london['GMT']
london.head(2)

The `iloc` attribute can still be used to get and display rows by number, but now you can now also use the `datetime64` index to get a row by date, using the dataframe's `loc` attribute, like this:

In [ ]:
london.loc[datetime(2014, 1, 1)]

A query such as *'Return all the rows where the date is between December 8th and December 12th'* can now be done  succinctly like this:

In [ ]:
london.loc[datetime(2014,12,8) : datetime(2014,12,12)]

#The meaning of the above code is get the rows beween and including 
#the indices datetime(2014,12,8) and datetime(2014,12,12)

Now we have a `datetime64` index, let's plot `'Max Wind SpeedKm/h'` again:

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True, figsize=(10,5))

Now it is much clearer that the worst winds were in mid February.

### Task
Use the code cell below to plot the values of `'Mean Humidity'` during spring (full months of March, April and May).

**Now go back to the course.**